<svelte:head>
    <link rel="stylesheet" href="https://unpkg.com/flickity@2.3.0/dist/flickity.css">
    <script src="https://unpkg.com/flickity@2.3.0/dist/flickity.pkgd.js"></script>-->
</svelte:head>

<div class="tbody">
    <div class="main-gallery js-flickity">
        <div class="gallery-cell"><img src="src/content/ru1.jpeg"></div>
        <div class="gallery-cell"><img src="src/content/ru2.webp"></div>
        <div class="gallery-cell"></div>
        <div class="gallery-cell"></div>
        <div class="gallery-cell"></div>
    </div>
    <p>
        Искусство может передавать смыслы. Это неограниченное пространство, в
        котором возможно делать всё как ты сам захочешь. Как этот сайт написан на
        каком-то языке программирования, эта статья изначально написана на русском,
        так и каждый творец на своём уникальном языке передаёт важный для него
        смысл. Это необычное представление наших мыслей, отчего и оценка смыслов
        приобретает более яркий оттенок.<br>

        Смыслов в СНГ очень много, в череде которых и веками нерешённые проблемы,
        внутренние установки которые мы называем менталитетом, чувства которые
        терзают многих из нас - это только часть того хаоса, происходящего в голове
        выходца из бывших частей соцстраны и настоящих независимых и сильных держав.<br>

        Этот сайт для каждого может нести разные цели. Для кого-то это место чтобы
        проникнуться нашими национальными особенностями, некоторые здесь
        задумываются о чём-то более вселенском. А кто-то хочет понять как мыслят
        художники, какими вопросами забита их голова. Важно то, что здесь ты можешь
        чем-то поделиться, поэтому более не задерживаю.

        Искусство может передавать смыслы. Это неограниченное пространство, в
        котором возможно делать всё как ты сам захочешь. Как этот сайт написан на
        каком-то языке программирования, эта статья изначально написана на русском,
        так и каждый творец на своём уникальном языке передаёт важный для него
        смысл. Это необычное представление наших мыслей, отчего и оценка смыслов
        приобретает более яркий оттенок.<br>

        Смыслов в СНГ очень много, в череде которых и веками нерешённые проблемы,
        внутренние установки которые мы называем менталитетом, чувства которые
        терзают многих из нас - это только часть того хаоса, происходящего в голове
        выходца из бывших частей соцстраны и настоящих независимых и сильных держав.<br>

        Этот сайт для каждого может нести разные цели. Для кого-то это место чтобы
        проникнуться нашими национальными особенностями, некоторые здесь
        задумываются о чём-то более вселенском. А кто-то хочет понять как мыслят
        художники, какими вопросами забита их голова. Важно то, что здесь ты можешь
        чем-то поделиться, поэтому более не задерживаю.

        Искусство может передавать смыслы. Это неограниченное пространство, в
        котором возможно делать всё как ты сам захочешь. Как этот сайт написан на
        каком-то языке программирования, эта статья изначально написана на русском,
        так и каждый творец на своём уникальном языке передаёт важный для него
        смысл. Это необычное представление наших мыслей, отчего и оценка смыслов
        приобретает более яркий оттенок.<br>

        Смыслов в СНГ очень много, в череде которых и веками нерешённые проблемы,
        внутренние установки которые мы называем менталитетом, чувства которые
        терзают многих из нас - это только часть того хаоса, происходящего в голове
        выходца из бывших частей соцстраны и настоящих независимых и сильных держав.<br>

        Этот сайт для каждого может нести разные цели. Для кого-то это место чтобы
        проникнуться нашими национальными особенностями, некоторые здесь
        задумываются о чём-то более вселенском. А кто-то хочет понять как мыслят
        художники, какими вопросами забита их голова. Важно то, что здесь ты можешь
        чем-то поделиться, поэтому более не задерживаю.

        Искусство может передавать смыслы. Это неограниченное пространство, в
        котором возможно делать всё как ты сам захочешь. Как этот сайт написан на
        каком-то языке программирования, эта статья изначально написана на русском,
        так и каждый творец на своём уникальном языке передаёт важный для него
        смысл. Это необычное представление наших мыслей, отчего и оценка смыслов
        приобретает более яркий оттенок.<br>

        Смыслов в СНГ очень много, в череде которых и веками нерешённые проблемы,
        внутренние установки которые мы называем менталитетом, чувства которые
        терзают многих из нас - это только часть того хаоса, происходящего в голове
        выходца из бывших частей соцстраны и настоящих независимых и сильных держав.<br>

        Этот сайт для каждого может нести разные цели. Для кого-то это место чтобы
        проникнуться нашими национальными особенностями, некоторые здесь
        задумываются о чём-то более вселенском. А кто-то хочет понять как мыслят
        художники, какими вопросами забита их голова. Важно то, что здесь ты можешь
        чем-то поделиться, поэтому более не задерживаю.
    </p>

</div>


<script>

</script>

<style lang="scss">

  .tbody {

    h2 {
      outline: none;
      margin: 10px;
      text-transform: uppercase;
      font-size: 36px;
      font-weight: 500;
    }

    .main-gallery {
      margin:10px 0 25px;

    .gallery-cell {
      width: 280px;
      height: 180px;
      margin-right: 10px;
      background: #322e2e;
    }

  }

    p {
      margin: 0px;
      padding: 0px;
      font-size: 16px;
    }

  }

</style>
