<svelte:head>
    <link rel="stylesheet" href="/build/flickity.css">
    <script src="build/flickity.js"></script>
</svelte:head>

<Dialog
        bind:open

>
    <Content id="fullscreen-content">
       <Button
       ><Label>{i_alt}</Label></Button>
    </Content>

</Dialog>

<div class="tbody">
    <div class="main-gallery js-flickity">
        <div class="gallery-cell"><img src="build/img/ru1.jpeg" alt="иноагенты" width="280" height="180" class="minimized" /></div>
        <div class="gallery-cell"><img src="build/img/ru2.webp" alt="к нему" width="280" height="180" class="minimized" /></div>
        <div class="gallery-cell"><img src="build/img/ru3.jpg" alt="различение" width="280" height="180" class="minimized" /></div>
        <div class="gallery-cell"><img src="build/img/ru4.jpg" alt="поиск пути" width="280" height="180" class="minimized" /></div>
        <div class="gallery-cell"><img src="build/img/ru5.webp" alt="мир в тебе" width="280" height="180" class="minimized" /></div>
    </div>
    <p>
        Искусство может передавать смыслы. Это неограниченное пространство, в
        котором возможно делать всё как ты сам захочешь. Как этот сайт написан на
        каком-то языке программирования, эта статья изначально написана на русском,
        так и каждый творец на своём уникальном языке передаёт важный для него
        смысл. Это необычное представление наших мыслей, отчего и оценка смыслов
        приобретает более яркий оттенок.</p>

    <p>Смыслов в СНГ очень много, в череде которых и веками нерешённые проблемы,
        внутренние установки которые мы называем менталитетом, чувства которые
        терзают многих из нас - это только часть того хаоса, происходящего в голове
        выходца из бывших частей соцстраны и настоящих независимых и сильных держав.</p>

    <p>Этот сайт для каждого может нести разные цели. Для кого-то это место чтобы
        проникнуться нашими национальными особенностями, некоторые здесь
        задумываются о чём-то более вселенском. А кто-то хочет понять как мыслят
        художники, какими вопросами забита их голова. Важно то, что здесь ты можешь
        чем-то поделиться, поэтому более не задерживаю.</p>
    <aside>
        <svg width="300" height="30">
            <path d=" M25 16 L275 16" stroke="black" stroke-width="1"/>
        </svg>
        <a href="#anchorby"> [беларусь] </a>

        <a href="#anchorukr"> [украина] </a>

        <a href="#anchorrus"> [россия] </a>
        <svg width="300" height="30">
            <path d=" M25 16 L275 16" stroke="black" stroke-width="1"/>
        </svg>
    </aside>

    <section id="by">
        <div id="anchorby"></div>
        <h3>Беларусь &#95;</h3>
        <img src="build/img/by_1.jpg" alt="Юрий Алисевич. Врата рая, 1995." width="540" height="320" class="minimized"/>
        <p>Беларусь не самая известная страна в европейском арт пространстве.</p>
        <p>Возможная этому причина - подавляющее преобладание государственных выставочных пространств,
            в которых никто особо не заинтересован целью открываться для иностранных выставок
            и продвигать собственные неординарные таланты.</p>

        <p>Традиционно, изобразительное искусство было монументальным и тематическим, наследуя советские шаблоны.
            Станковая живопись Беларуси с конца 1990-х отличается возрождением интереса к живописи подчеркнуто колористического качества.</p>
        <p>Своеобразной чертой последних десятилетий стала сосредоточенность художника на проблемах внутреннего,
            а не внешнего мира. Это качество явилось отражением массового сознания населения.
            Расширились проявления синкретизма изобразительных приемов, взаимовлияния видов искусства.</p>
        <p>В последние годы заметен интерес авторов, имеющих художественное образование,
            кино, к фотографии, что обогащает панораму фотоискусства.
            Этот процесс направляет развитие фотографии в русло концептуальности.</p>
    </section>
    <section id="ukr">
        <div id="anchorukr" ></div>
        <h3>Украина &#95;</h3>
        <img src="build/img/ukr_1.jpg" alt="Борис Михайлов. Из серии наложения, 1970-е." width="540" height="320" class="minimized" />
        <p>Украина, в массовом сознании её населения отличается своими порывами от ближайших соседей.</p>
        <p>Поэтому отличается и искусство, которое стремится к западноевропейскому образу.
            Первые сквоты появились в Киеве в 1990-х и уже тогда стала очевидной попытка художников перевернуть обыденное восприятие действительности.</p>
        <p>Одно из ключевых отличий Украины от других - беспредельная открытость и эпатажность.
            Человеческие чувства, пороки, государственные процессы выражены настолько иронично и иногда нагловато, что это может заставить зрителя смущаться.
            В целом, юмористический контекст скорее нужен как "обезболивающее перед операцией", хотя он и присутствует в абсолютно разных сюжетах.
            Ирония помогает художникам представлять сюжеты не такими критическими, и в то же время облегает восприятие у зрителя.</p>
        <p>Тема которая проходит сквозь практически все выставки это вопрос самоопределения.
            Куда идти дальше? Запад или восток? Художники не пытаются дать ответ, а лишь показывают "за и против".</p>
    </section>
    <section id="rus">
        <div id="anchorrus"></div>
        <h3>Россия &#95;</h3>
        <img src="build/img/rus1.jpg" alt="Олег Хвостов. Пейзаж с коровами, 2011." width="540" height="320" class="minimized" />
        <p>Написать что то конкретное о России сложнее всего. Это интернациональная площадка, в которой переплелись разные идеи, разных государств СНГ.</p>
        <p>Конец XX века ознаменовался в российском искусстве активным поиском национальной идентичности,
            а также борьбой за место на мировой арт-сцене.
            Стёб над устоявшимися традициями характерен для 90-х. Тогда начинал разиваться феномен интернационального художественного сообщества.
            Это время ярких, а иногда даже безумных, перформансов, эпатажных жестов и открытого вызова обществу.</p>
        <p>В «нулевые» ситуация в современном искусстве меняется кардинально: оно выходит из разряда «маргинального» и институциализируется.
            Самоорганизованные сквоты сменились площадками для экспонирования современного искусства.</p>
        <p>«Десятые» годы связаны с попыткой систематизировать и осмыслить
            историю российского современного искусства как институционально, так и в выставочной практике.</p>
        <p>События 2020 оказали огромное влияние на все мировое сообщество и уже нашли отражение в творчестве многих художников.
            Классик современной фотографии Сергей Братков также ухватил образ новой пандемической реальности.</p>
    </section>
</div>


<script>
    import Dialog, { Content, Actions } from '@smui/dialog';
    import Button, { Label } from '@smui/button'
    let open = false;

    export var i_alt = "";

    import { useParams } from "svelte-navigator";

    const params = useParams();

    $: console.log($params); // -> { id: "123", splat: "pauls-profile" }

    window.$(function(){
        window.$('.minimized').click(function(event) {
            open = true
            var i_path = window.$(this).attr('src');
            i_alt = window.$(this).attr('alt');
            window.$('#fullscreen-content').prepend('<div id="pict"><img src="'+i_path+'""></div>');
        });
        window.$('.mdc-dialog__scrim').click(function() {
            window.$('#pict').remove();
        });
    });
</script>

<style lang="scss">


  .tbody {

    p {
      text-indent: 15px;
      margin: 16px 0;
    }

    h2 {
      outline: none;
      margin: 10px;
      text-transform: uppercase;
      font-size: 36px;
      font-weight: 500;
    }

    .main-gallery {
      margin: 10px 0 25px;

      &::-webkit-scrollbar {
        width: 0;
      }

      .gallery-cell {
        width: 280px;
        height: 180px;
        margin-right: 10px;
        padding: 5px 0 5px 0;
      }
    }

    aside {
      text-align: center !important;
      display: flex;
      flex-flow: row nowrap;
      justify-content: center;

        a {
          color: black;
          padding: 5px 5px;

          &:hover {
            transition: 330ms;
            color: #c7b592;
          }
        }
    }

    #by, #ukr, #rus {
      float: left;
      clear: both;
      position:relative;

      div#anchorby, div#anchorukr, div#anchorrus {
        position:absolute;
        top:-74px;
      }

      h3 {
        margin: 19px 10px;

      }

      img {
        float: left;
        margin: 0 17px
      }
    }

    .minimized {
      cursor: pointer;
      transition: 0.33s;
    }

    .minimized:hover {
      transform: scale(1.05);
    }
  }

</style>
